---
kind: property
id: P:Autodesk.Revit.DB.View3D.IsSectionBoxActive
zh: 三维视图、3d视图
source: html/177a4ab8-b7cb-0b3f-3672-64b78246d851.htm
---
# Autodesk.Revit.DB.View3D.IsSectionBoxActive Property

**中文**: 三维视图、3d视图

Identifies whether or not the section box is active in this 3D view.

## Syntax (C#)
```csharp
public bool IsSectionBoxActive { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Returns true if the view is not a view template.